from flask import Flask, jsonify, request
from flask_restful import Resource, Api
import pickle

    
app = Flask(__name__)
api = Api(app)

STREETS = {'آبکوه': 4, 'آپادانا': 12, 'آیت الله دستغیب': 13, 'اسفندیانی': 26, 'تربیت': 60, 'تورج': 64, 'توفیق': 66, 'دانشسرا': 92, 'دهخدا': 97, 'سنایی': 124, 'شجریان (ارشاد سابق)': 127, 'شهید صادقی': 137, 'صاحب الزمان(منطقه  1)\r\n': 144, 'قاضی طباطبایی': 179, 'مجد': 183, 'مطهری جنوبی': 191, 'هجرت(شهید صادقی)': 230, 'کلاهدوز': 256, 'ابن سینا -دانشگاه': 15, 'ابونصر': 19, 'بابک': 41, 'دانشگاه': 93, 'راهنمایی': 101, 'سلمان فارسی': 122, 'سناباد': 123, 'قائم(احمدآباد)\r\n': 176, 'مولوی(سناباد)': 205, 'پاستور': 243, 'پاسداران': 244, 'چمران': 251, 'کفایی': 255, 'گلستان': 265, 'ابوذر غفاری': 17, 'احمدآباد': 20, 'بعثت': 48, 'حکیم نظامی': 83, 'رضا': 106, 'عدالت': 155, 'محتشمی': 185, 'ناصر خسرو': 209, 'نوفل لوشاتو': 220, 'کوهسنگی': 260, 'بزرگمهر': 47, 'بنفشه(سجاد)': 52, 'بهارستان': 55, 'حامد جنوبی': 74, 'حامد شمالی': 75, 'خیام جنوبی': 87, 'سجاد': 116, 'فرهاد': 167, 'فلسطین': 171, 'ملک اباد': 197, 'نیلوفر': 223, 'گویا': 267, 'یاسمن': 270, 'امیرکبیر': 34, 'بهشتی': 56, 'جهان آرا': 72, 'رودکی': 111, 'نامجو': 210, 'نماز فرد از 27 به بعد زوج از 26 به بعد': 215, 'آزاده': 8, 'ابرار': 14, 'ادیب': 21, 'استاد یوسفی': 24, 'امام دوست': 30, 'امامیه': 33, 'اندیشه': 36, 'بهورز': 58, 'حجاب': 76, 'حسابی': 78, 'حسابی جنوبی': 79, 'حسابی شمالی': 80, 'رازی(قاسم آباد)': 100, 'رستگاری': 105, 'شاهد': 126, 'شریعتی': 128, 'شهید راستی': 135, 'شهید رفیعی': 136, 'فلاحی': 170, 'قاسم آباد': 178, 'مروارید': 188, 'مشکینی': 189, 'میعاد': 208, 'نیکی': 224, 'هاشمی رفسنجانی زوج(میثاق)': 225, 'هاشمی مهنه': 227, 'یوسفیه': 271, 'آزادشهر': 7, 'آزادی زوج(از 2 تا 50)': 9, 'آموزگار فرد تا 37 و زوج تا 40': 10, 'امامت': 32, 'جلال آل احمد ( ایرج میرزا )': 69, 'دانش آموز': 90, 'سروش': 120, 'سیدرضی': 125, 'فرهنگ': 168, 'معلم فرد تا 35 و زوج تا 28': 194, 'مهران فرد از 1 تا 19 و زوج از 2 تا 20': 201, 'وکیل آباد (فرد تا 27)': 238, 'آموزگار(فرد از 39 زوج از42)': 11, 'ارمغان': 23, 'دانشجو': 91, 'دندانپزشکان': 96, 'ستاری': 115, 'شهید قانع': 138, 'صدف': 148, 'فارغ التحصیلان': 162, 'قائم مقام فراهانی': 175, 'معاد': 193, 'معلم(فرداز 37-زوج از 30)': 195, 'مهران فرد از 21  و زوج از 22 ': 202, 'نمایشگاه': 216, 'وکیل آباد فرداز 27': 241, 'پژوهش': 247, 'اقدسیه': 28, 'الهیه': 29, 'امیریه': 35, 'بوستان': 59, 'تقویه': 61, 'رحمانیه': 102, 'سجادیه': 117, 'صادقیه': 145, 'عزیزیه': 157, 'عصمتیه': 158, 'مجیدیه': 184, 'محمدیه': 187, 'مهدیه': 200, 'نقویه': 212, 'هاشمی رفسنجانی فرد(میثاق)': 226, ' آیت الله بهجت': 0, ' کاشانی': 2, 'حسین باشی': 81, 'شیرازی': 140, 'عبادی': 153, 'موحدین': 203, 'میدان توحید': 206, 'هاشمی نژاد': 228, 'کامیاب': 253, ' ساجدی': 1, 'بلوار فردوسی': 51, 'بنفشه(فرامرز عباسی)': 53, 'بهاران': 54, 'تلاش': 62, 'ثمانه': 67, 'جانباز': 68, 'رسالت (فرامرز)': 104, 'فرامرز عباسی': 166, 'مهدی(فرامرز)\r\n': 199, 'یاس(جانباز)': 268, 'ابوطالب': 18, 'اسدالله زاده (موسوی قوچانی)': 25, 'ایثارگران': 39, 'بزرگراه شهید چراغچی': 46, 'حرعاملی': 77, 'شفا': 129, 'شیشه چی': 142, 'عبدالمطلب': 154, 'قرنی': 180, 'لاله(عبدلمطلب)': 182, 'مطهری شمالی': 192, 'موسوی قوچانی': 204, 'هدایت': 231, 'هنرور': 235, 'کریمی': 254, 'یاس(عبدلمطلب)': 269, 'بلوار شهید شکری': 50, 'توس': 65, 'خیام شمالی': 88, 'فدک': 165, 'ولیعصر': 237, 'کوی امیرالمومنین': 262, 'رسالت': 103, 'طبرسی جنوبی': 151, 'طبرسی شمالی': 152, 'فاطمیه': 163, 'گاز': 263, 'ابوذر': 16, 'ایثار': 38, 'تلگرد': 63, 'رضائیه': 107, 'علیمردانی': 159, 'مفتح': 196, 'میدان عسگریه': 207, 'وحید': 236, 'شیرودی': 141, 'صدوقی(چهنو)': 149, 'محمد آباد': 186, 'مصلی': 190, 'کارمندان': 252, 'دانش': 89, 'عنصری': 161, 'فدائیان اسلام': 164, 'فرودگاه': 169, 'نواب صفوی': 217, 'هفده شهریور': 233, 'پروین اعتصامی': 246, 'ایمان': 40, 'شهرک ابوذر': 132, 'صبا(شهید اصلانی)': 147, 'قائم(کوی مهدی)\r\n': 177, 'کوشش': 259, 'آخوند خراسانی': 5, 'امام رضا': 31, 'بلوار امام خمینی': 49, 'جنت': 70, 'جهاد': 71, 'خسروی(اندرزگو)': 85, 'رازی': 99, 'سرشور': 119, 'سعدی': 121, 'شهید دیالمه': 134, 'عدل خمینی': 156, 'ملک الشعرا بهار': 198, 'کوچه چهنو(امام رضا 5)': 261, 'اقبال لاهوری': 27, 'برسلانی': 43, 'برونسی': 44, 'حافظ': 73, 'شقایق(منطقه 9)': 130, 'شهرستانی': 131, 'صابر': 143, 'صارمی': 146, 'صیاد شیرازی': 150, 'عمادخراسانی(حافظیه)': 160, 'فکوری زوج(از2تا18)فرد(1تا15)': 173, 'لادن': 181, 'نور': 218, 'وکیل آباد زوج از 26 تا آخر': 239, 'ویلا': 242, 'پیروزی فرد(از 49تا81 و زوج54تا86)': 250, 'گلدیس': 264, 'آبادگران': 3, 'آرمان': 6, 'ارغوان': 22, 'انوری': 37, 'باهنر': 42, 'حق شناس': 82, 'خاقانی': 84, 'خضرائی منش': 86, 'دعبل خزایی': 94, 'دلاوران': 95, 'رادان': 98, 'رضاشهر': 108, 'رضوی': 109, 'رهایی': 110, 'زکریا': 112, 'زیتون': 113, 'سرافرازان': 118, 'شهرک طالقانی': 133, 'شهید کاوه': 139, 'فکوری زوج(از54تا92)فرد(51تا87)': 174, 'نخل': 211, 'نماز فرد از 19 تا 25 زوج از 20 تا 24': 214, 'نوکاریزی': 221, 'نیاوران': 222, 'پایداری': 245, 'پیروزی فرد (از 1تا31 و زوج2تا30)': 248, 'برکپور': 45, 'بهمن(هاشمیه)': 57, 'سامانیه': 114, 'فکوری زوج(از20تا52)فرد(17تا49)': 172, 'نماز زوج از 2 تا 18 فرد از 1 تا 17': 213, 'نوزده بهمن': 219, 'هاشمیه': 229, 'هفت تیر': 232, 'هنرستان': 234, 'وکیل آباد زوج از 4 تا 24': 240, 'پیروزی فرد(از 33تا47 و زوج32تا52)': 249, 'کوثر جنوبی': 257, 'کوثر شمالی': 258, 'گلشن': 266}
NEIGHBORHOODS = {'آبکوه': 2, 'احمدآباد': 4, 'بعثت': 6, 'سجاد': 9, 'کوهسنگی': 19, 'قاسمآباد': 14, 'آزادشهر': 3, 'دانشجو': 7, 'الهیه': 5, 'شهدا': 11, 'فرامرزعباسی': 13, 'هدایت': 16, 'کویامیرالمومنین': 20, 'گاز': 21, 'طلاب': 12, 'مصلی': 15, '17شهریور': 0, 'سیدی': 10, 'چهارراهلشکر': 18, 'آبوبرق': 1, 'رضاشهر': 8, 'هنرستان': 17}


class Home(Resource):
    def get(self):
        return jsonify({'message': 'please go to /predict/...'})
  
    def post(self):
        data = request.get_json()
        return jsonify({'data': data}), 201
  

class Predict(Resource):
  
    def get(self, typ, area, region, neighborhood, street,
            age, floor, bedrooms):
        
        with open('pred.nn', 'rb')  as f:
            knn = pickle.load(f)
        
        data = [[typ, area, region, NEIGHBORHOODS[neighborhood], STREETS[street],
            age, floor, bedrooms]]
        p = knn.predict(data)
        
        return jsonify({'type' : typ, 'area' : area, 'region' : region,
                        'neighborhood' : neighborhood, 'street' : street,
                        'age' : age, 'floor' : floor, 'bedrooms' : bedrooms,
                        'price' : p[0]})
  

api.add_resource(Home, '/')
api.add_resource(Predict, '/predict/<int:typ>/<int:area>/<int:region>/<string:neighborhood>/<string:street>/<int:age>/<int:floor>/<int:bedrooms>')
  
# localhost:8080/predict/0/95/12/الهیه/الهیه/5/4/2

if __name__ == '__main__':
    app.run(port=8080)
